Repository: erifejams/Webapp-for-TU-Dublin-Exam-Service
Catalog: labproj/locale/*/LC_MESSAGES/django.po
Languages: ga, no

source: English
ga: Béarla
no: Engelsk

source: Irish
ga: Gaeilge
no: Irsk

source: Norwegian
ga: Ioruais
no: Norsk

source: Norway
ga: Ioruais
no: Norsk

source: Ireland
ga: Éireann
no: Irland

source: Homepage
ga: Leathanach baile
no: Hjemmeside

source: Location
ga: Suíomh
no: Sted

source: Appeals
ga: Achomhairc
no: Appeller

source: Timetable
ga: Amchlár
no: Rutetabell

source: Examinations
ga: Scrúduithe
no: Helsesjekk

source: Frequently Asked Questions
ga: Ceisteanna Coitianta
no: Vanlige spørsmål

source: This page is to find the answer to your examination questions. Examinations are in two sessions, Christmas and summer exams. You will have to site these exams depending on the programme you are registered for, unless there is a valid excuse.
ga: Tá an leathanach seo chun freagra do cheisteanna scrúdaithe a fháil. Bíonn na scrúduithe i dhá sheisiún, scrúduithe na Nollag agus an tsamhraidh. Beidh ort na scrúduithe seo a shuíomh ag brath ar an gclár a bhfuil tú cláraithe dó, mura bhfuil leithscéal bailí ann.
no: Denne siden skal finne svaret på eksamensoppgavene dine. Eksamener er i to økter, jule- og sommereksamener. Du må plassere disse eksamenene avhengig av hvilket program du er registrert for, med mindre det er gyldig unnskyldning.

source: Resources
ga: Acmhainní
no: Ressurser

source: Where do I access past papers?
ga: Cá bhfaighidh mé iarpháipéir?
no: Hvor får jeg tilgang til tidligere papirer?

source: Past examination papers can be accessed via the <u><b>Library Portal
ga: Is féidir teacht ar iarpháipéir scrúdaithe tríd an Tairseach Leabharlainne <u> <b>
no: Tidligere eksamensoppgaver kan nås via <u><b>Biblioteksportalen</b></u>

source: How can I access my exam timetable?
ga: Conas is féidir liom teacht ar mo chlár ama scrúduithe?
no: Hvordan får jeg tilgang til eksamensplanen?

source: Timetables are available on the TU Dublin website <u><b>exam section</b></u> and are published approximately one month before exams commence. Publish dates will be widely advertised through social media and email.
ga: Tá amchláir ar fáil ar shuíomh Gréasáin TU Bhaile Átha Cliath <u> <b> roinn na scrúduithe </b> </u> agus foilsítear iad thart ar mhí sula dtosaíonn na scrúduithe. Fógrófar dátaí foilsithe go forleathan trí na meáin shóisialta agus ríomhphost.
no: Tidsplaner er tilgjengelige på TU Dublin- <u><b>eksamensseksjonen</b></u> og publiseres omtrent en måned før eksamenene starter. Publiseringsdatoer vil bli mye annonsert gjennom sosiale medier og e-post.

source: How can I find the location of my exams?
ga: Conas is féidir liom suíomh mo scrúduithe a fháil?
no: Hvordan finner jeg plasseringen til eksamenene mine?

source: The location of the exam will be detailed to each student in advance of the date normally with the exam timetable. Students should familiarize themselves with the location of the exam prior to the date of their first exam. On occasion the location of an exam may change for operational reasons, students <u><b>should check</b></u> the website for updates in advance of the day.
ga: Tabharfar mionsonraí ar shuíomh an scrúdaithe do gach mac léinn roimh an dáta de ghnáth le tráthchlár na scrúduithe. Ba chóir do mhic léinn eolas a chur ar shuíomh an scrúdaithe roimh dháta a gcéad scrúdaithe. Uaireanta is féidir go n-athróidh suíomh an scrúdaithe ar chúiseanna oibríochta, ba cheart do mhic léinn <u> <b> an suíomh Gréasáin a sheiceáil </b> </u> chun nuashonruithe a fháil roimh an lá.
no: Plasseringen av eksamen vil bli detaljert for hver student i forkant av datoen som normalt med eksamensplanen. Studentene skal gjøre seg kjent med plasseringen av eksamen før datoen for deres første eksamen. Noen ganger kan plasseringen av en eksamen endres av operasjonelle grunner, <u><b>bør</b></u> studentene <u><b>sjekke</b></u> nettstedet for oppdateringer i forkant av dagen.

source: Examination
ga: Scrúdú
no: Undersøkelse

source: Do I need to register for exams?
ga: An gá dom clárú le haghaidh scrúduithe?
no: Må jeg registrere meg til eksamen?

source: All registered students are automatically entered for exams.
ga: Cuirtear gach mac léinn cláraithe isteach go huathoibríoch le haghaidh scrúduithe.
no: Alle registrerte studenter blir automatisk lagt opp til eksamen.

source: What do I need to gain entry to the exam venue on the day?
ga: Cad a theastaíonn uaim chun iontráil a fháil san ionad scrúduithe ar an lá?
no: Hva trenger jeg for å komme inn på eksamensstedet på dagen?

source: All students should present a current <u><b>Student ID Card</b></u> to gain entry to an examination venue. Alternative photographic ID is also acceptable i.e. Passport or Garda ID.
ga: Ba chóir do gach mac léinn <u> <b> Cárta Aitheantais Mac Léinn </b> </u> reatha a chur i láthair chun iontráil a fháil in ionad scrúdaithe. Glacfar le haitheantas grianghrafadóireachta malartach i.e. Pas nó ID an Gharda Síochána.
no: Alle studenter bør presentere et gjeldende <u><b>student-ID-kort for</b></u> å få adgang til et eksamenssted. Alternativ fotografisk ID er også akseptabel, dvs. Pass eller Garda ID.

source: What happens if I am late for the exam?
ga: Cad a tharlóidh má táim déanach don scrúdú?
no: Hva skjer hvis jeg kommer for sent til eksamen?

source: Normally, no student shall be admitted to the Exam more than one half hour after the start of the exam; in exceptional circumstances however, and provided that no other student sitting the same paper has left the Exam a student may be admitted later, at the discretion of the Exam Secretary. In such circumstances extra time will not normally be allowed.
ga: De ghnáth, ní ligfear aon mhac léinn isteach sa Scrúdú níos mó ná leathuair an chloig tar éis thús an scrúdaithe; in imthosca eisceachtúla, áfach, agus ar choinníoll nach bhfágfaidh aon mhac léinn eile a shuíonn an páipéar céanna an Scrúdú féadfar mac léinn a ligean isteach níos déanaí, de rogha Rúnaí an Scrúdaithe. Sna himthosca sin ní cheadófar am breise de ghnáth.
no: Normalt skal ingen student ta opp til eksamen mer enn en halv time etter eksamensstart; under eksepsjonelle omstendigheter, og forutsatt at ingen andre studenter som sitter på det samme papiret har forlatt eksamen, kan en student tas opp senere, etter eksamenssekretærens skjønn. Under slike omstendigheter vil det normalt ikke være tillatt med ekstra tid.

source: What happens if I think I may have the wrong exam paper?
ga: Cad a tharlóidh má cheapaim go bhfuil an páipéar scrúdaithe mícheart agam?
no: Hva skjer hvis jeg tror jeg kan ha feil eksamensoppgave?

source: If you think you have the wrong exam paper it is important that you notify and check with the exam invigilator immediately, it is up to you to ensure you are in possession of the correct paper and that you follow the instructions printed on the exam paper and the answer book.
ga: Má cheapann tú go bhfuil an páipéar scrúdaithe mícheart agat tá sé tábhachtach go dtabharfaidh tú fógra agus seiceáil le feitheoir an scrúdaithe láithreach, is fútsa atá sé a chinntiú go bhfuil an páipéar ceart agat agus go leanann tú na treoracha atá clóite ar an bpáipéar scrúdaithe agus an leabhar freagraí.
no: Hvis du mener at du har feil eksamensoppgave, er det viktig at du gir beskjed til og kontrollerer med eksamensvakten umiddelbart, er det opp til deg å forsikre deg om at du har riktig papir og at du følger instruksjonene trykt på eksamensoppgaven og svarboka.

source: Do I need to confirm my attendance at the exam?
ga: An gá dom mo fhreastal ar an scrúdú a dhearbhú?
no: Må jeg bekrefte at jeg deltar på eksamen?

source: Students shall sign the Attendance Form when requested by the Invigilator, and shall leave their Student ID Card in a visible position on the desk.
ga: Sínfidh mic léinn an Fhoirm Tinrimh nuair a iarrfaidh an Feitheoir é, agus fágfaidh siad a gCárta Aitheantais Mac Léinn in áit infheicthe ar an deasc.
no: Studentene skal signere fremmøtelsesskjemaet når de blir bedt om det av tilsynsføreren, og skal la student-ID-kortet sittes synlig på pulten.

source: Special Arrangements, Illness and withdrawal
ga: Socruithe Speisialta, Breoiteacht agus tarraingt siar
no: Spesielle ordninger, sykdom og tilbaketrekning

source: I am a student with a disability , I need extra help during the exams, what do I do?
ga: Is mac léinn faoi mhíchumas mé, teastaíonn cúnamh breise uaim le linn na scrúduithe, cad a dhéanfaidh mé?
no: Jeg er en student med nedsatt funksjonsevne, jeg trenger ekstra hjelp under eksamenene, hva gjør jeg?

source: If you are a student with a disability, ensure you register with the <b><u>Disability Service</u></b> well in advance of the exam to ensure special arrangements can be put in place for the duration of exams.
ga: Más mac léinn faoi mhíchumas tú, déan cinnte go gcláróidh tú leis an <b> <u> Seirbhís Míchumais </u> </b> i bhfad roimh an scrúdú lena chinntiú go bhféadtar socruithe speisialta a chur i bhfeidhm ar feadh ré na scrúduithe .
no: Hvis du er en student med nedsatt funksjonsevne, må du forsikre deg om at du registrerer deg i <b><u>funksjonshemmingstjenesten</u></b> i god tid før eksamen for å sikre at spesielle ordninger kan settes i gang under eksamenens varighet.

source: I need to take medication during my exam, should I tell someone before the exam starts?
ga: Caithfidh mé cógais a ghlacadh le linn mo scrúdaithe, ar cheart dom a rá le duine sula dtosaíonn an scrúdú?
no: Jeg må ta medisiner under eksamenen, skal jeg si det til noen før eksamen starter?

source: Students required to take medication during an exam must inform the invigilator prior to commencement of the exam.
ga: Ní mór do mhic léinn a gceanglaítear orthu cógais a ghlacadh le linn scrúdaithe an feitheoir a chur ar an eolas sula dtosaíonn an scrúdú.
no: Studenter som er pålagt å ta medisiner under en eksamen, må informere tilkallingsvakten før eksamen begynner.

source: What happens if there is a serious incident during the exam?
ga: Cad a tharlóidh má tharlaíonn eachtra thromchúiseach le linn an scrúdaithe?
no: Hva skjer hvis det er en alvorlig hendelse under eksamen?

source: In the event of fire or other serious cause the safety of the students and the Institutes staff shall be the primary concern and the Invigilator(s) shall evacuate the Exam in an orderly manner and without delay. In such circumstances the exam shall be declared void and shall be rescheduled.
ga: I gcás dóiteáin nó cúis thromchúiseach eile is é sábháilteacht na mac léinn agus fhoireann na nInstitiúidí an phríomhchúram agus aslonnóidh an Feitheoir / na Feitheoirí an Scrúdú ar bhealach ordúil agus gan mhoill. Sna himthosca sin dearbhófar an scrúdú a bheith ar neamhní agus déanfar é a athsceidealú.
no: I tilfelle brann eller annen alvorlig årsak skal studentenes og instituttets sikkerhet være den største bekymringen, og tilsynsmannen (e) skal evakuere eksamenen på en ordnet måte og uten forsinkelse. Under slike omstendigheter skal eksamenen erklæres ugyldig og omlegges om.

source: Exams in
ga: Scrúduithe i
no: Eksamener

source: By
ga: Le
no: Av

source: Menu
ga: Roghchlár
no: Meny

source: Pick your Country
ga: Roghnaigh do Thír
no: Velg ditt land

source: UK
ga: An Ríocht Aontaithe
no: Storbritannia

source: Common Questions
ga: Ceisteanna Coitianta
no: Vanlige spørsmål

source: No.
ga: Níl.
no: Nei.

source: A <u><b>Student ID Card</b></u> is needed to enter the exam venue.
ga: Teastaíonn Cárta Aitheantais <u> <b> Mac Léinn </b> </u> chun dul isteach san ionad scrúdaithe.
no: Et <u><b>student-ID-kort</b></u> er nødvendig for å komme inn på eksamensstedet.

source: Students are not allowed to enter the Exam more than one half hour after the start of the exam, except in some circumstances and if no other students sitting the same paper has left the exam hall. In those circumstances extra time will not be allowed.
ga: Ní cheadaítear do mhic léinn dul isteach sa Scrúdú níos mó ná leathuair an chloig tar éis thús an scrúdaithe, ach amháin in imthosca áirithe agus mura bhfágann aon mhac léinn eile a shuíonn an páipéar céanna halla an scrúdaithe. Sna himthosca sin ní cheadófar am breise.
no: Studenter har ikke lov til å gå opp til eksamen mer enn en halv time etter oppstart av eksamen, bortsett fra under noen omstendigheter, og hvis ingen andre studenter som har samme oppgave har forlatt eksamenshallen. Under disse omstendighetene blir det ikke tillatt ekstra tid.

source: How can I find the location of my exams?
ga: Conas is féidir liom suíomh mo scrúduithe a fháil?
no: Hvordan finner jeg plasseringen til eksamenene mine?

source: The location of the exam will be emailed to each student in advance of the date with the exam timetable. Students should familiarize themselves with the location of the exam prior to the date of their first exam. On occasion the location of an exam may change for operational reasons, students <u><b>should check</b></u> the website for updates in advance of the day.
ga: Tabharfar mionsonraí ar shuíomh an scrúdaithe do gach mac léinn roimh an dáta de ghnáth le tráthchlár na scrúduithe. Ba chóir do mhic léinn eolas a chur ar shuíomh an scrúdaithe roimh dháta a gcéad scrúdaithe. Uaireanta is féidir go n-athróidh suíomh an scrúdaithe ar chúiseanna oibríochta, ba cheart do mhic léinn <u> <b> an suíomh Gréasáin a sheiceáil </b> </u> chun nuashonruithe a fháil roimh an lá.
no: Plasseringen av eksamen vil bli detaljert for hver student i forkant av datoen som normalt med eksamensplanen. Studentene skal gjøre seg kjent med plasseringen av eksamen før datoen for deres første eksamen. Noen ganger kan plasseringen av en eksamen endres av operasjonelle grunner, <u><b>bør</b></u> studentene <u><b>sjekke</b></u> nettstedet for oppdateringer i forkant av dagen.

source: Related Content
ga: Ábhar Gaolmhar
no: Relatert innhold

source: Exam Result
ga: Toradh Scrúdaithe
no: Eksamensresultat

source: Where can I access my result?
ga: Cá bhfaighidh mé mo thoradh?
no: Hvor kan jeg få tilgang til resultatet mitt?

source: Students will be sent a link to their student email, when the results are available.
ga: Seolfar nasc chuig a r-phost mac léinn chuig mic léinn, nuair a bheidh na torthaí ar fáil.
no: Studentene får tilsendt en lenke til studentenes e-post når resultatene er tilgjengelige.

source: How will I find out if my results are ready for release?
ga: Conas a gheobhaidh mé amach an bhfuil mo thorthaí réidh le scaoileadh?
no: Hvordan finner jeg ut om resultatene mine er klare til utgivelse?

source: All students will be notified by e-mail to their student e-mail account outlining the dates and times for release of exam results.
ga: Tabharfar fógra do gach mac léinn trí r-phost chuig a gcuntas ríomhphoist mac léinn ag imlíniú na dátaí agus na hamanna chun torthaí na scrúduithe a scaoileadh.
no: Alle studenter vil bli varslet på e-post til studentenes e-postkonto som viser datoene og tidspunktene for utgivelse av eksamensresultater.

source: I have failed my repeat exam what should I do?
ga: Theip orm mo athscrúdú cad ba cheart dom a dhéanamh?
no: Jeg har mislyktes i gjentakseksamen, hva skal jeg gjøre?

source: If you have failed your repeat exam/s you have three possible options open to you :
ga: Má theip ort do athscrúdú / scrúduithe tá trí rogha féideartha ar fáil duit:
no: Hvis du har mislykket gjentatte eksamener, har du tre mulige alternativer for deg:

source: Carry the module into the next year: <br><b>Students may only ever carry a maximum of 10 ECTS credits so if you have failed more than 10 ECTS Credits this option is not available to you. Each school has different rules regarding carry modules and the decision of the exam board regarding carries is final. In some cases schools will not allow their students to carry any modules they retain the right to do.
ga: Déan an modúl an bhliain seo chugainn: <br> <b> Ní fhéadfaidh mic léinn ach 10 gcreidmheas ECTS a iompar riamh agus mar sin má theip ort níos mó ná 10 gCreidmheas ECTS níl an rogha seo ar fáil duit. Tá rialacha difriúla ag gach scoil maidir le modúil iompair agus is cinneadh críochnaitheach cinneadh an bhoird scrúdaithe maidir le hiompar. I roinnt cásanna ní ligfidh scoileanna dá gcuid mac léinn modúil ar bith a choinníonn siad an ceart a dhéanamh.
no: Gjennomfør modulen til neste år: <br> <b> Studenter har bare maksimalt 10 studiepoeng, så hvis du har mislykket mer enn 10 studiepoeng, er dette alternativet ikke tilgjengelig for deg. Hver skole har forskjellige regler når det gjelder bæremoduler, og eksamensstyrets avgjørelse om karrierer er endelig. I noen tilfeller vil ikke skolene tillate elevene å bære moduler de har rett til.

source: Internally repeat
ga: Déan arís go seachtrach
no: Gjenta internt

source: Externally repeat
ga: Déan arís go seachtrach
no: Gjenta eksternt
